[
  {
    "memory_id": "mem_001",
    "updated_date": "2025-06-30T10:00:00Z",
    "content": "Started coding journey at NITR with C programming in first year, still remember the excitement of writing first 'Hello World' program in the computer lab"
  },
  {
    "memory_id": "mem_002",
    "updated_date": "2025-06-30T10:05:00Z",
    "content": "Became addicted to Valorant during pandemic lockdown, reached Diamond rank playing Sage and Omen, favorite map is Bind"
  },
  {
    "memory_id": "mem_003",
    "updated_date": "2025-06-30T10:10:00Z",
    "content": "Arsenal fan since college days, never missed a match during NITR years, used to gather with friends in hostel common room to watch Premier League"
  },
  {
    "memory_id": "mem_004",
    "updated_date": "2025-06-30T10:15:00Z",
    "content": "Turned vegetarian in second year of college after visiting animal shelter during NSS activity, never looked back since then"
  },
  {
    "memory_id": "mem_006",
    "updated_date": "2025-06-30T10:25:00Z",
    "content": "Currently working on a React Native app project in spare time, reminds me of final year project where we built Android app using Java"
  },
  {
    "memory_id": "mem_007",
    "updated_date": "2025-06-30T10:30:00Z",
    "content": "Valorant team chemistry with college friends still intact after graduation, we have a Discord server called 'NITR Radiants' for daily gaming sessions"
  },
  {
    "memory_id": "mem_008",
    "updated_date": "2025-06-30T10:35:00Z",
    "content": "Follow Indian Super League religiously now, but EPL will always be first love, Thierry Henry poster still hangs in home office"
  },
  {
    "memory_id": "mem_009",
    "updated_date": "2025-06-30T10:40:00Z",
    "content": "Favorite vegetarian protein sources include paneer, dal, quinoa, and Greek yogurt - learned to cook these during bachelor days in Rourkela"
  },
  {
    "memory_id": "mem_010",
    "updated_date": "2025-06-30T10:45:00Z",
    "content": "Nostalgic about NITR's Aarohan fest where we organized coding competitions, miss the energy and enthusiasm of college technical events"
  },
  {
    "memory_id": "mem_011",
    "updated_date": "2025-06-30T10:50:00Z",
    "content": "Learning Python during engineering sparked interest in data science, now working with pandas and matplotlib for personal analytics projects"
  },
  {
    "memory_id": "mem_012",
    "updated_date": "2025-06-30T10:55:00Z",
    "content": "Valorant rank progression from Iron to Diamond took 2 years, same dedication I had for mastering algorithms during competitive programming at NITR"
  },
  {
    "memory_id": "mem_013",
    "updated_date": "2025-06-30T11:00:00Z",
    "content": "Football knowledge expanded from just watching to understanding tactics, formations, and transfer markets - became obsession during college years"
  },
  {
    "memory_id": "mem_014",
    "updated_date": "2025-06-30T11:05:00Z",
    "content": "Vegetarian cooking skills improved significantly at 40, can now make restaurant-quality dal makhani and palak paneer from scratch"
  },
  {
    "memory_id": "mem_015",
    "updated_date": "2025-06-30T11:10:00Z",
    "content": "NITR campus walks during evening hours were therapeutic, especially around the lake - miss those peaceful moments between study sessions"
  },
  {
    "memory_id": "mem_016",
    "updated_date": "2025-06-30T11:15:00Z",
    "content": "GitHub profile shows progression from college projects to professional work, first repository was uploaded during third year at NITR"
  },
  {
    "memory_id": "mem_017",
    "updated_date": "2025-06-30T11:20:00Z",
    "content": "Valorant community became second family, especially NITR batch mates who moved to different cities but still squad up every weekend"
  },
  {
    "memory_id": "mem_018",
    "updated_date": "2025-06-30T11:25:00Z",
    "content": "Fantasy Premier League addiction started in final year, still maintaining same league with college friends after 15+ years"
  },
  {
    "memory_id": "mem_019",
    "updated_date": "2025-06-30T11:30:00Z",
    "content": "Vegetarian diet philosophy strengthened over years, now advocate for plant-based nutrition among friends and family"
  },
  {
    "memory_id": "mem_021",
    "updated_date": "2025-06-30T11:40:00Z",
    "content": "Current tech stack includes React, Node.js, and MongoDB - evolution from college days when we primarily used C++, Java, and MySQL"
  },
  {
    "memory_id": "mem_022",
    "updated_date": "2025-06-30T11:45:00Z",
    "content": "Valorant mechanics training routine inspired by disciplined study schedule from NITR days - 1 hour daily aim training and deathmatch"
  },
  {
    "memory_id": "mem_023",
    "updated_date": "2025-06-30T11:50:00Z",
    "content": "Football analysis hobby grew from casual watching to understanding xG statistics, heat maps, and tactical breakdowns"
  },
  {
    "memory_id": "mem_024",
    "updated_date": "2025-06-30T11:55:00Z",
    "content": "Vegetarian meal prep strategy includes batch cooking lentils, quinoa salads, and protein smoothies for busy work weeks"
  },
  {
    "memory_id": "mem_025",
    "updated_date": "2025-06-30T12:00:00Z",
    "content": "NITR library Level 3 was coding sanctuary during placement preparation, solved over 500 LeetCode problems in that corner desk"
  },
  {
    "memory_id": "mem_026",
    "updated_date": "2025-06-30T12:05:00Z",
    "content": "Open source contributions started during final semester, first pull request was fixing documentation bug in popular Python library"
  },
  {
    "memory_id": "mem_027",
    "updated_date": "2025-06-30T12:10:00Z",
    "content": "Valorant agent preferences evolved from duelist main to controller/sentinel flex player, reflects maturity in both gaming and life"
  },
  {
    "memory_id": "mem_028",
    "updated_date": "2025-07-02T17:16:57.941032",
    "content": "The best places to visit in Japan include Tokyo, Kyoto, and Osaka. Tokyo is known for its blend of traditional and modern attractions, while Kyoto offers a rich cultural heritage with numerous temples and shrines. Osaka, often referred to as the \"Dining Capital of Japan,\" features vibrant street food scenes and lively entertainment districts."
  },
  {
    "memory_id": "mem_029",
    "updated_date": "2025-07-03T23:29:38.565625",
    "content": "Assistant: Extracted Facts:"
  },
  {
    "memory_id": "mem_030",
    "updated_date": "2025-07-03T23:30:08.256412",
    "content": "1. The user initiated a conversation with an inquiry about how the AI assistant is doing."
  },
  {
    "memory_id": "mem_031",
    "updated_date": "2025-07-03T23:30:36.975411",
    "content": "2. The AI assistant confirmed it doesn't have feelings but is ready to help and asked how it can assist the user."
  },
  {
    "memory_id": "mem_032",
    "updated_date": "2025-07-03T23:34:26.422246",
    "content": "Assistant: The user initiated a conversation by asking how the AI assistant is doing. The AI responded that it doesn't have feelings but is ready to assist."
  },
  {
    "memory_id": "mem_033",
    "updated_date": "2025-07-03T23:36:26.395640",
    "content": "1. User needs suggestions for Indian vegetarian curry dishes."
  },
  {
    "memory_id": "mem_034",
    "updated_date": "2025-07-03T23:36:55.582668",
    "content": "2. Assistant recommends Paneer Makhani, Chana Masala, and Aloo Gobi as great options."
  },
  {
    "memory_id": "mem_035",
    "updated_date": "2025-07-03T23:42:15.162731",
    "content": "Extracted Facts:"
  },
  {
    "memory_id": "mem_036",
    "updated_date": "2025-07-12T16:04:42.198636",
    "content": "Patient has a history of asthma and uses an inhaler as needed."
  },
  {
    "memory_id": "mem_037",
    "updated_date": "2025-07-12T16:19:13.944827",
    "content": "User initiated a conversation with greetings."
  },
  {
    "memory_id": "mem_038",
    "updated_date": "2025-07-12T16:20:42.183631",
    "content": "The name of the user's university is NITR."
  },
  {
    "memory_id": "mem_039",
    "updated_date": "2025-07-12T16:22:24.040719",
    "content": "On 12-07-2025, the user visited the dentist."
  },
  {
    "memory_id": "mem_040",
    "updated_date": "2025-07-12T16:24:20.707301",
    "content": "Kadane's Algorithm is used to find the maximum sum of a contiguous subarray within a one-dimensional array of numbers."
  },
  {
    "memory_id": "mem_041",
    "updated_date": "2025-07-12T16:34:33.221255",
    "content": "User has been regularly visiting the dentist every month for health check-ups."
  }
]